# CalculationType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropData..::..CalculationType Property
DuctFittingAndAccessoryPressureDropData Class See Also
---
The calculation type, a bitmask of FittingAndAccessoryCalculationType.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int CalculationType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CalculationType As Integer
	Get
```

Visual C++
---
```text
public:
property int CalculationType {
	int get ();
}
```

# See Also
DuctFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace